package day08;

public class ArrEx11 {
	
	public static void main(String[] args) {
		
		/*
		문제 : Up & Down 게임
		0 ~ 99 사이의 임의의 수를 받아 숨기고, 그 수를 맞추는 게임 
		임의의 수보다 낮게 입력하면 "Up" 출력, 
		높게 입력하면 "Down" 출력하면서 범위를 좁혀가며 수를 맞춘다. 
		게임을 반복하기 위해서  y/n묻고, n인 경우 프로그램 종료. 
		콘솔예)
		숫자가 정해졌습니다. 맞춰보세요!!
		0 ~ 99
		1 >>  55 (<-- 사용자 입력) 
		"Up"
		55 ~ 99
		2 >> 70
		"Up"
		70 ~ 99 
		3 >> 85
		"Down"
		70 ~ 85
		4 >> 75
		"Up"
		75 ~ 85
		5 >> 82
		맞았습니다.
		다시하시겠습니까?(y/n) >>  y
		숫자가 정해졌습니다. 맞춰보세요!
		0 ~ 99
		1 >> 30
		"Up"
		30 ~ 99
		2 >> 45
		맞았습니다. 
		다시하시겠습니까?(y/n) >> n
		게임종료!!
	*/
		
		
	}
}
