package day01;
/*
 * 	클래스 class : 자바는 클래스들로 구성되어있다.
 * 	class 클래스명 {
 *	//변수, 상수, 메서드(함수)등 모든 프로그램 요소를 작성
 * 	}
 * 	클래스 명명규칙 : 첫글자 대문자,띄어쓰기x, 숫자로 시작x
 * 					특수기호는_ $ 만 가능, 키워드x, 대소문자 구분

 * */

public class Test01 { //class 만든것 파일명과 클래스명이 같아야함

	public static void main(String[] args) {
		//메인 메서드
		System.out.println("hello");
		// 출력문
		
		//실행 : ctrl + f11
		//주석 : (//)메모 또는 실행하고 싶지 않은 코드를 처리할때 사용
		/*통으로 주석하고싶을떄*/
		/*
		 * System : 윈도우
		 * out : 밖으로
		 * println : 출력해라~
		 * . : 모든 전산 용어에서 "내가 가지고 있는~, 알고있는~"
		 * () : 소활호 {} 중괄호 [] 대괄호
		 * ex) println( <--소문자다음 소괄호면 기능을하는 [메서드]
		 * "" : 문자열
		 * ; : 세미콜론  여기서 부터 여기까지가 명령어 끝이야
		 * : : 콜론
		 *tap : 들여쓰기
		 *{} : 영역
		 */
		
		
		
		
		
	}//main
}//class 닫치는 부분
